OpenFOAM-v2506/modules/OpenQBMM/tutorials/denseAGFoam/fluidizedBed/0/U.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0.38 0);

boundaryField
{
    walls
    {
        type                fixedValue;
        value               uniform (0 0 0);
    }
    outlet
    {
        type                inletOutlet;
        phi                 phi.gas;
        inletValue          uniform (0 0 0);
        value               $internalField;
    }
    inlet
    {
        type                interstitialInletVelocity;
        inletVelocity       uniform (0 0.38 0);
        alpha               alpha.gas;
        value               $internalField;
    }
    frontAndBackPlanes
    {
        type                empty;
    }
}

// ************************************************************************* //
